html/20231211T161252--introduce-yourself-to-git__git.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>introduce yourself to git</title>
<link rel="stylesheet" href="../css/style.css"/></head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">14 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231211T161252--introduce-yourself-to-git__git.html">introduce yourself to git</a></h1>
<p>
When on new system, you might get such message when trying to perform a
push/pull git command:
</p>

<blockquote>
<p>
Author identity unknown
</p>

<p>
Please tell me who you are.
</p>

<p>
Run
</p>

<p>
git config &#x2013;global user.email "you@example.com"
</p>

<p>
git config &#x2013;global user.name "Your Name"
</p>
</blockquote>

<p>
In my case that would be:
</p>

<div class="org-src-container">
<pre class="src src-bash">git config --global user.email "azegaspa@gmail.com"
git config --global user.name "arvydasg"
</pre>
</div>

<p>
You will get prompted for a password.
</p>

<p>
There are multiple ways to get that password:
</p>
<ul class="org-ul">
<li>write your git password manually each time</li>
<li><a href="20231214T060637--authenticate-to-git-with-personal-access-token__git.html">authenticate with personal access token</a></li>
<li><a href="20231214T060558--authenticate-to-git-with-ssh__git_ssh.html">authenticate with ssh</a></li>
<li><a href="20231214T061312--authenticate-to-git-with-gpg-key__git_gpg.html">authenticate with gpg</a></li>
</ul>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-git.html">git</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
